In [3]:
import pandas as pd

## 시리즈 만들기
= Series() 메소드에 리스트를 전달하여 시리즈 생성

In [4]:
s = pd.Series(['Wes McKinney','Creator of Pandas'])
print(s)

0         Wes McKinney
1    Creator of Pandas
dtype: object

In [6]:
s = pd.Series(['Wes McKinney','Creator of Pandas'], index=['Person','Who']) # 갯수를 맞춰주어야한다
print(s)

s = pd.Series(['Wes McKinney','Creator of Pandas',30], index=['Person','Who','age']) # 갯수를 맞춰주어야한다
print(s)

Person         Wes McKinney
Who       Creator of Pandas
dtype: object
Person         Wes McKinney
Who       Creator of Pandas
age                      30
dtype: object

## 데이터 프레임 만들기
- DataFrame() 메소드에 딕셔너리를 전달하여 데이터 프레임 생성

In [8]:
scientists = pd.DataFrame({
    'Name' : ['RF', 'WG'],
    'Occupation' : ['Chemist','Statistician'],
    'Born': ['1920-07-25','1876-06-13'],
    'Died':['1958-04-16','1937-10-16'],
    'Age':[37,61]
})
print(scientists)

  Name    Occupation        Born        Died  Age
0   RF       Chemist  1920-07-25  1958-04-16   37
1   WG  Statistician  1876-06-13  1937-10-16   61

In [12]:
scientists = pd.DataFrame(
    
    data ={
        #'Name' : ['RF', 'WG'],
        'Occupation' : ['Chemist','Statistician'],
        'Born': ['1920-07-25','1876-06-13'],
        'Died':['1958-04-16','1937-10-16'],
        'Age':[37,61]
    },
    index = ['RF','WG'],
    columns = ['Occupation','Born','Age','Died']
    
)

print(scientists)

      Occupation        Born  Age        Died
RF       Chemist  1920-07-25   37  1958-04-16
WG  Statistician  1876-06-13   61  1937-10-16

In [15]:
scientists = pd.DataFrame(
    
    data ={
        #'Name' : ['RF', 'WG'],
        'Occupation' : ['Chemist','Statistician'],
        'Born': ['1920-07-25','1876-06-13'],
        'Died':['1958-04-16','1937-10-16'],
        'Age':[37,61]
    },
    index = ['RF','WG'],
    columns = ['Occupation','Born','Age','Died']
    
)

#loc
first_row = scientists.loc['WG']
print(type(first_row))
print(first_row)

<class 'pandas.core.series.Series'>
Occupation    Statistician
Born            1876-06-13
Age                     61
Died            1937-10-16
Name: WG, dtype: object

In [18]:
#iloc
first_irow = scientists.iloc[1]
print(type(first_row))
print(first_row)

<class 'pandas.core.series.Series'>
Occupation    Statistician
Born            1876-06-13
Age                     61
Died            1937-10-16
Name: WG, dtype: object

In [20]:
#index 속성 사용하기
print(first_row.index)

#value 속성 사용하기
print(first_row.values)

#key 속성 사용하기 (== index 속성)
print(first_row.keys())

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')
['Statistician' '1876-06-13' 61 '1937-10-16']
Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

- 기초 통계 메소드 사용하기

In [22]:
ages = scientists['Age']
print(ages)

print(ages.mean())
print(ages.min())
print(ages.max())
print(ages.std())

RF    37
WG    61
Name: Age, dtype: int64
49.0
37
61
16.97056274847714

In [24]:
ages = scientists['Age']
ages

RF    37
WG    61
Name: Age, dtype: int64

In [25]:
print(ages.sum())

98

In [26]:
scientists.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, RF to WG
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Occupation  2 non-null      object
 1   Born        2 non-null      object
 2   Age         2 non-null      int64
 3   Died        2 non-null      object
dtypes: int64(1), object(3)
memory usage: 188.0+ bytes

In [32]:
scientists.describe()

             Age
count   2.000000
mean   49.000000
std    16.970563
min    37.000000
25%    43.000000
50%    49.000000
75%    55.000000
max    61.000000

In [59]:
scientists = pd.read_csv('./data/scientists.csv')

In [61]:
ages = scientists['Age']
print(ages.max(),ages.mean())

90 59.125

In [62]:
scientists.describe()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [64]:
ages > ages.mean() #boolean 
print(ages[ages > ages.mean()])

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [66]:
# 브로드캐스팅
print(ages + ages) # 벡터 + 벡터
print(ages + 100) # 벡터 + 스칼라

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64
0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [68]:
print(ages+pd.Series([1,100])) #0,1 인덱스만 계산되고 나머지는 누락값(NaN)으로 처리

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

- sort_index([ascending=False])

In [70]:
rev_ages = ages.sort_index(ascending=False)  # 인덱스 기준으로 내림차순 정렬
print(rev_ages)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [75]:
print(ages)
print(ages *  2)

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64
0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [74]:
print(ages + rev_ages)     # 동일한 인덱스를 찾아서 두개의 값을 더함

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

- boolean array

In [79]:
scientists['Age'] > scientists['Age'].mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [84]:
scientists[scientists['Age'] > scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [87]:
scientists[scientists['Occupation'] == 'Chemist']

                Name        Born        Died  Age Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37    Chemist
3        Marie Curie  1867-11-07  1934-07-04   66    Chemist

In [92]:
# 열의 자료형 바꾸기
print(scientists['Born'].dtypes)
print(scientists['Died'].dtypes)

object
object

In [94]:
born_datetime = pd.to_datetime(scientists['Born'],format='%Y-%m-%d')
print(born_datetime)

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [96]:
Died_datetime = pd.to_datetime(scientists['Died'],format='%Y-%m-%d')
print(Died_datetime)

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [102]:
scientists['Born_dt'] = born_datetime
scientists['Died_dt'] = Died_datetime

scientists

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [108]:
#scientists['Born_dt'], scientists['Died_dt'] = (Born_datetime, Died_datetime)
scientists.head()

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14

In [109]:
scientists2 = scientists.loc[  :  ,  ['Name','Born_dt','Died_dt','Age','Occupation'   ] ]
scientists2

                   Name    Born_dt    Died_dt  Age          Occupation
0     Rosaline Franklin 1920-07-25 1958-04-16   37             Chemist
1        William Gosset 1876-06-13 1937-10-16   61        Statistician
2  Florence Nightingale 1820-05-12 1910-08-13   90               Nurse
3           Marie Curie 1867-11-07 1934-07-04   66             Chemist
4         Rachel Carson 1907-05-27 1964-04-14   56           Biologist
5             John Snow 1813-03-15 1858-06-16   45           Physician
6           Alan Turing 1912-06-23 1954-06-07   41  Computer Scientist
7          Johann Gauss 1777-04-30 1855-02-23   77       Mathematician

In [113]:
scientists['age_days_dt'] = (scientists['Died_dt'] - scientists['Born_dt'])
scientists

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

## 데이터 삭제하기
### drop(['인덱스' 또는 '열이름'][, axis=n])

In [120]:
scientists.drop(0).head(2)

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt,age_days_dt
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days

In [121]:
scientists.drop([0,1]).head(2)

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt,age_days_dt
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days

### 여러개 행 삭제

In [155]:
scientists.drop([1,2])

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [159]:
scientists.drop('Name',axis = 1)

,Born,Died,Age,Occupation,Born_dt,Died_dt,age_days_dt
0,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

### 여러개 열 삭제

In [202]:
x = scientists.drop(scientists.columns[[1,2]], axis = 1)
x

,Name,Age,Occupation,Born_dt,Died_dt,age_days_dt
0,Rosaline Franklin,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [126]:
scientists3 = scientists.copy()   # copy() : 원본유지 - 다른 메모리를 사용하여 복사하는 것으로 원본데이터가 변하지 않음
scientists3

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [128]:
list1 = [1,2,3]
list2 = list1

In [130]:
list1

[1, 2, 3]

In [132]:
list2[0] = 4

In [134]:
list2

[4, 2, 3]

In [135]:
list1

[4, 2, 3]

In [137]:
list1 is list2

True

In [138]:
scientists3.drop(0, inplace=True)   # inplace=True : 바뀐 데이터 저장

In [140]:
scientists3

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt,age_days_dt
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

## pickle

In [146]:
names = scientists['Name']
names.to_pickle('./data/scientists_names_series.pickle')

In [148]:
pd.read_pickle('./data/scientists_names_series.pickle')

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [163]:
scientists.to_csv('./data/scientists.csv')

In [183]:
df = pd.read_csv('./data/scientists.csv',index_col=0) # 불러올 때 인덱스 지정을 해줘야함

In [184]:
df

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

In [190]:
df = pd.read_csv('./data/scientists.csv', delimiter=',', index_col=0)
df

,Name,Born,Died,Age,Occupation,Born_dt,Died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

## Excel (저장하기)

- conda install xlwt
- conda install openpyxl

In [192]:
!conda install -y openpyxl

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.

In [195]:
names_df = scientists[['Name']]    #['Name'].to_frame()

In [197]:
import xlwt
import openpyxl

In [204]:
names_df.to_excel('./data/scientists_names_series_df.xls')
names_df.to_excel('./data/scientists_names_series_df.xlsx')

C:\Users\admin\AppData\Local\Temp\ipykernel_9928\3626969732.py:1: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  names_df.to_excel('./data/scientists_names_series_df.xls')

In [209]:
!conda install -y xlrd

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.

In [211]:
pd.read_excel('./data/scientists_names_series_df.xls', index_col=0)

                   Name
0     Rosaline Franklin
1        William Gosset
2  Florence Nightingale
3           Marie Curie
4         Rachel Carson
5             John Snow
6           Alan Turing
7          Johann Gauss